app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1
---
<div class="comments">
<% @post.comments.each do |c| %>