app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
INSERT INTO "comments" ("author", "content", "created_at", "post_id", "title", "updated_at", "user_id", "vote") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @post = Post.find(params[:post_id])
    @comment = Comment.new

    @comment.title =  params[:title]
    @comment.content =  params[:content]
    @comment.post_id = params[:post_id]
    @comment.author = params[:author]
    #add userid to comment if logged in
    if session[:user_id]
      @comment.user_id = session[:user_id]
      anyuser = User.find(session[:user_id])
      if anyuser
        @comment.author = anyuser.username
      else
        @comment.author = "Nobody!!!"
      end
    end
   if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "comments" SET "content" = 'dsagdfgfff', "updated_at" = '2012-06-21 05:21:02.328506' WHERE "comments"."id" = 1
---
  def update
    @comment = Comment.find(params[:id])

    respond_to do |format|
      if @comment.update_attributes(params[:comment])