app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts" WHERE (content LIKE '')

  def show
    @post = Post.find(params[:id])

    postid = -1
    if @post
      postid = @post.id
    end

    #GET comments for this post
    @comments = Comment.find_all_by_post_id(postid)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1

  def create
    @post = Post.new(params[:post])
    @post.user_id = session[:user_id]

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "df"], ["created_at", Sun, 17 Jun 2012 05:11:00 UTC +00:00], ["title", "dfvg"], ["updated_at", Sun, 17 Jun 2012 05:11:00 UTC +00:00], ["user_id", 5]]

  def update
    @post = Post.find(params[:id])
    @post.user_id = session[:user_id]
    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "user_id" = 5, "content" = 'dfkhbjjklb', "updated_at" = '2012-06-20 01:13:58.186472' WHERE "posts"."id" = 1

  def destroy
    @post = Post.find(params[:id])
    if @post.user.id == session[:user_id]
      @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]