app/controllers/users_controller.rb

  def create


    @user = User.new(params[:user])



    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("admin_flag", "created_at", "description", "email", "first_name", "last_name", "password", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    secure_user_access
    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "first_name" = 'sfdsf', "description" = 'sdefsdf', "updated_at" = '2012-06-21 05:03:47.357506' WHERE "users"."id" = 8

  def destroy
    @user = User.find(params[:id])
    secure_user_access
    @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]